In [87]:
import pandas as pd
import numpy as np

# Reshaping data
- 전처리 (Data preprocessing)
- 원본 데이터의 구조가 분석 기법에 맞지 않아서 행과 열의 위치를 바꾼다거나,
- 특정 요인에 따라 집계를 해서 구조를 바꿔주어야 함

## Pivot
> data.pivot(index, columns, values)

> pd.pivot_table(data, index, columns, values)
- aggfunc=np.mean : index 중복값에 대해 해결 (np.mean : default)
- margins=True : 행과 열을 기준으로 합계를 같이 제시

> pivot_table()은 되고, pivot()은 안되는 경우
- index가 2개 이상인 경우
- columns가 2개 이상인 경우
- pivot() 함수는 중복값이 있을 경우 ValueError를 반환, 반면에 pd.pivot_table()은 aggregation(집계)할 수 있는 함수를 제공함에 따라 index 중복값이 있는 경우에도 문제없음.

In [88]:
data = pd.DataFrame({'cust_id': ['c1', 'c1', 'c1', 'c2', 'c2', 'c2', 'c3', 'c3', 'c3'],
                  'prod_cd': ['p1', 'p2', 'p3', 'p1', 'p2', 'p3', 'p1', 'p2', 'p3'],
                  'grade' : ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B'],
                  'pch_amt': [30, 10, 0, 40, 15, 30, 0, 0, 10]})
data

  cust_id prod_cd grade  pch_amt
0      c1      p1     A       30
1      c1      p2     A       10
2      c1      p3     A        0
3      c2      p1     A       40
4      c2      p2     A       15
5      c2      p3     A       30
6      c3      p1     B        0
7      c3      p2     B        0
8      c3      p3     B       10

### pivot

In [89]:
data_pivot = data.pivot(index = 'cust_id',
                        columns='prod_cd',
                        values = 'pch_amt')
data_pivot

prod_cd  p1  p2  p3
cust_id
c1       30  10   0
c2       40  15  30
c3        0   0  10

### pivot_table

In [90]:
data_pivot_table = pd.pivot_table(data, index='cust_id', 
                                  columns='prod_cd', 
                                  values='pch_amt',
                                  margins=True)
data_pivot_table

prod_cd         p1         p2         p3        All
cust_id
c1       30.000000  10.000000   0.000000  13.333333
c2       40.000000  15.000000  30.000000  28.333333
c3        0.000000   0.000000  10.000000   3.333333
All      23.333333   8.333333  13.333333  15.000000

## Stack
> stack : (위에서 아래로 길게, 높게) 쌓는 것
- Series를 return함
- dropna = True : 결측값을 제거 (default)

> unstack : 쌓은 것을 옆으로 늘어놓는 것(왼쪽에서 오른쪽으로 넓게) 
- Series를 return

In [91]:
mul_index = pd.MultiIndex.from_tuples([('cust_1', '2015'), ('cust_1', '2016'),
                                       ('cust_2', '2015'), ('cust_2', '2016')])
mul_index

MultiIndex([('cust_1', '2015'),
            ('cust_1', '2016'),
            ('cust_2', '2015'),
            ('cust_2', '2016')],
           )

In [92]:
data = pd.DataFrame(data = np.arange(16).reshape(4,4),
                   index = mul_index,
                   columns = ['prd_1','prd_2','prd_3','prd_4'],
                   dtype = 'int')
data

             prd_1  prd_2  prd_3  prd_4
cust_1 2015      0      1      2      3
       2016      4      5      6      7
cust_2 2015      8      9     10     11
       2016     12     13     14     15

### stack

In [93]:
data_stacked = data.stack(level=-1, dropna=True)
data_stacked

cust_1  2015  prd_1     0
              prd_2     1
              prd_3     2
              prd_4     3
        2016  prd_1     4
              prd_2     5
              prd_3     6
              prd_4     7
cust_2  2015  prd_1     8
              prd_2     9
              prd_3    10
              prd_4    11
        2016  prd_1    12
              prd_2    13
              prd_3    14
              prd_4    15
dtype: int32

In [94]:
# Series를 return
type(data_stacked)

pandas.core.series.Series

In [95]:
data_stacked.index

MultiIndex([('cust_1', '2015', 'prd_1'),
            ('cust_1', '2015', 'prd_2'),
            ('cust_1', '2015', 'prd_3'),
            ('cust_1', '2015', 'prd_4'),
            ('cust_1', '2016', 'prd_1'),
            ('cust_1', '2016', 'prd_2'),
            ('cust_1', '2016', 'prd_3'),
            ('cust_1', '2016', 'prd_4'),
            ('cust_2', '2015', 'prd_1'),
            ('cust_2', '2015', 'prd_2'),
            ('cust_2', '2015', 'prd_3'),
            ('cust_2', '2015', 'prd_4'),
            ('cust_2', '2016', 'prd_1'),
            ('cust_2', '2016', 'prd_2'),
            ('cust_2', '2016', 'prd_3'),
            ('cust_2', '2016', 'prd_4')],
           )

In [96]:
# indexing
data_stacked['cust_2']['2015'][['prd_1', 'prd_2']]

prd_1    8
prd_2    9
dtype: int32

### unstack

In [97]:
data_stacked

cust_1  2015  prd_1     0
              prd_2     1
              prd_3     2
              prd_4     3
        2016  prd_1     4
              prd_2     5
              prd_3     6
              prd_4     7
cust_2  2015  prd_1     8
              prd_2     9
              prd_3    10
              prd_4    11
        2016  prd_1    12
              prd_2    13
              prd_3    14
              prd_4    15
dtype: int32

In [98]:
data_stacked.unstack(level=-1)

             prd_1  prd_2  prd_3  prd_4
cust_1 2015      0      1      2      3
       2016      4      5      6      7
cust_2 2015      8      9     10     11
       2016     12     13     14     15

In [99]:
data_stacked.unstack(level=0)

            cust_1  cust_2
2015 prd_1       0       8
     prd_2       1       9
     prd_3       2      10
     prd_4       3      11
2016 prd_1       4      12
     prd_2       5      13
     prd_3       6      14
     prd_4       7      15

In [100]:
data_stacked.unstack(level=1)

              2015  2016
cust_1 prd_1     0     4
       prd_2     1     5
       prd_3     2     6
       prd_4     3     7
cust_2 prd_1     8    12
       prd_2     9    13
       prd_3    10    14
       prd_4    11    15

In [101]:
type(data_stacked.unstack(level=-1))

pandas.core.frame.DataFrame

In [102]:
data_stacked_unstacked = data_stacked.unstack(level=-1)
data_stacked_unstacked

             prd_1  prd_2  prd_3  prd_4
cust_1 2015      0      1      2      3
       2016      4      5      6      7
cust_2 2015      8      9     10     11
       2016     12     13     14     15

In [103]:
# converting index to columns (reset_index())
data_stacked_unstacked_df = data_stacked_unstacked.reset_index()
data_stacked_unstacked_df

  level_0 level_1  prd_1  prd_2  prd_3  prd_4
0  cust_1    2015      0      1      2      3
1  cust_1    2016      4      5      6      7
2  cust_2    2015      8      9     10     11
3  cust_2    2016     12     13     14     15

In [104]:
data_stacked_unstacked_df.rename(columns={'level_0' : 'custID',
                                          'level_1' : 'year'}, inplace=True)
data_stacked_unstacked_df

   custID  year  prd_1  prd_2  prd_3  prd_4
0  cust_1  2015      0      1      2      3
1  cust_1  2016      4      5      6      7
2  cust_2  2015      8      9     10     11
3  cust_2  2016     12     13     14     15

## Melt

### pd.melt

In [105]:
data = pd.DataFrame({'cust_ID' : ['C_001', 'C_001', 'C_002', 'C_002'],
                 'prd_CD' : ['P_001', 'P_002', 'P_001', 'P_002'],
                 'pch_cnt' : [1, 2, 3, 4],
                 'pch_amt' : [100, 200, 300, 400]})
data

  cust_ID prd_CD  pch_cnt  pch_amt
0   C_001  P_001        1      100
1   C_001  P_002        2      200
2   C_002  P_001        3      300
3   C_002  P_002        4      400

In [106]:
pd.melt(data, id_vars=['cust_ID','prd_CD'])

  cust_ID prd_CD variable  value
0   C_001  P_001  pch_cnt      1
1   C_001  P_002  pch_cnt      2
2   C_002  P_001  pch_cnt      3
3   C_002  P_002  pch_cnt      4
4   C_001  P_001  pch_amt    100
5   C_001  P_002  pch_amt    200
6   C_002  P_001  pch_amt    300
7   C_002  P_002  pch_amt    400

In [107]:
data_melt = pd.melt(data, id_vars=['cust_ID','prd_CD'],
       var_name = 'pch_CD',
       value_name = 'pch_value')
data_melt

  cust_ID prd_CD   pch_CD  pch_value
0   C_001  P_001  pch_cnt          1
1   C_001  P_002  pch_cnt          2
2   C_002  P_001  pch_cnt          3
3   C_002  P_002  pch_cnt          4
4   C_001  P_001  pch_amt        100
5   C_001  P_002  pch_amt        200
6   C_002  P_001  pch_amt        300
7   C_002  P_002  pch_amt        400

In [108]:
data_melt_pivot = pd.pivot_table(data_melt, index=['cust_ID', 'prd_CD'],
               columns='pch_CD', values='pch_value',
               aggfunc=np.mean)
data_melt_pivot

pch_CD          pch_amt  pch_cnt
cust_ID prd_CD
C_001   P_001       100        1
        P_002       200        2
C_002   P_001       300        3
        P_002       400        4

###  melt, pivot_table 비교
- melt()는 ID가 칼럼으로 존재.
- 반면에, pivot_table()은 ID가 index로 들어감.

In [109]:
print(data_melt.index)
print(data_melt.columns)

print('\n')

print(data_melt_pivot.index)
print(data_melt_pivot.columns)

RangeIndex(start=0, stop=8, step=1)
Index(['cust_ID', 'prd_CD', 'pch_CD', 'pch_value'], dtype='object')


MultiIndex([('C_001', 'P_001'),
            ('C_001', 'P_002'),
            ('C_002', 'P_001'),
            ('C_002', 'P_002')],
           names=['cust_ID', 'prd_CD'])
Index(['pch_amt', 'pch_cnt'], dtype='object', name='pch_CD')

## wide_to_long
- 칼럼 이름의 앞부분"과 나머지 "칼럼 이름의 뒷부분"을 구분해서,
- 칼럼 이름의 앞부분을 칼럼 이름으로, 칼럼 이름의 나머지 뒷부분을 행(row)의 원소로 해서 세로로 길게(long~) 쌓음.

In [110]:
np.random.seed(10)

In [111]:
data_wide = pd.DataFrame({"A1970" : {0 : "a", 1 : "b", 2 : "c"},
                          "A1980" : {0 : "d", 1 : "e", 2 : "f"},
                          "B1970" : {0 : 2.5, 1 : 1.2, 2 : .7},
                          "B1980" : {0 : 3.2, 1 : 1.3, 2 : .1},
                          "X"     : dict(zip(range(3), np.random.randn(3)))
                         })
data_wide

  A1970 A1980  B1970  B1980         X
0     a     d    2.5    3.2  1.331587
1     b     e    1.2    1.3  0.715279
2     c     f    0.7    0.1 -1.545400

In [112]:
data_wide["id"] = data_wide.index
data_wide

  A1970 A1980  B1970  B1980         X  id
0     a     d    2.5    3.2  1.331587   0
1     b     e    1.2    1.3  0.715279   1
2     c     f    0.7    0.1 -1.545400   2

In [113]:
data_long = pd.wide_to_long(data_wide, ['A', 'B'], i="id", j="year")
data_long

                X  A    B
id year
0  1970  1.331587  a  2.5
1  1970  0.715279  b  1.2
2  1970 -1.545400  c  0.7
0  1980  1.331587  d  3.2
1  1980  0.715279  e  1.3
2  1980 -1.545400  f  0.1

In [114]:
print(data_wide.index)
print(data_wide.columns)

print('\n')

print(data_long.index)
print(data_long.columns)

Int64Index([0, 1, 2], dtype='int64')
Index(['A1970', 'A1980', 'B1970', 'B1980', 'X', 'id'], dtype='object')


MultiIndex([(0, 1970),
            (1, 1970),
            (2, 1970),
            (0, 1980),
            (1, 1980),
            (2, 1980)],
           names=['id', 'year'])
Index(['X', 'A', 'B'], dtype='object')

## Crosstab
- 범주형 변수로 되어있는 요인(factors)별로 교차분석(cross tabulations) 하여,
- 행, 열 요인 기준 별로 빈도를 세어서 
- 도수분포표(frequency table), 교차표(contingency table)를 만들어줌

> pd.crosstab(index, columns)

In [115]:
data = pd.DataFrame({'id': ['id1', 'id1', 'id1', 'id2', 'id2', 'id3'],
                  'fac_1': ['a', 'a', 'a', 'b', 'b', 'b'],
                  'fac_2': ['d', 'd', 'd', 'c', 'c', 'd']})
data

    id fac_1 fac_2
0  id1     a     d
1  id1     a     d
2  id1     a     d
3  id2     b     c
4  id2     b     c
5  id3     b     d

### basic

In [116]:
pd.crosstab(data.fac_1, data.fac_2)

fac_2  c  d
fac_1
a      0  3
b      2  1

In [117]:
pd.crosstab(data.id, data.fac_1)

fac_1  a  b
id
id1    3  0
id2    0  2
id3    0  1

In [118]:
pd.crosstab(data.id, data.fac_2)

fac_2  c  d
id
id1    0  3
id2    2  0
id3    0  1

### multi-index, multi-level

In [119]:
pd.crosstab(data.id, [data.fac_1, data.fac_2])

fac_1  a  b
fac_2  d  c  d
id
id1    3  0  0
id2    0  2  0
id3    0  0  1

In [120]:
pd.crosstab([data.fac_1, data.fac_2], data.id)

id           id1  id2  id3
fac_1 fac_2
a     d        3    0    0
b     c        0    2    0
      d        0    0    1

### rownames, colnames

In [121]:
pd.crosstab(data.id, [data.fac_1, data.fac_2],
            rownames=['id_num'],
            colnames=['a_b', 'c_d'])

a_b     a  b
c_d     d  c  d
id_num
id1     3  0  0
id2     0  2  0
id3     0  0  1

### 행 합, 열 합 추가
- margins = True

In [122]:
pd.crosstab(data.id, [data.fac_1, data.fac_2],
            margins=True)

fac_1  a  b    All
fac_2  d  c  d
id
id1    3  0  0   3
id2    0  2  0   2
id3    0  0  1   1
All    3  2  1   6

### 비율
- normalize = True

In [123]:
pd.crosstab(data.id, [data.fac_1, data.fac_2],
            normalize=True)

fac_1    a         b
fac_2    d         c         d
id
id1    0.5  0.000000  0.000000
id2    0.0  0.333333  0.000000
id3    0.0  0.000000  0.166667